; domain
(define (domain gripper-strips)
 (:requirements :strips :typing :constraints) 
 (:types type_3 object type_1 type_2)
 (:predicates (pred_3 ?v7 - type_1 ?v5 - type_3)
 	      (pred_1 ?v2 - object ?v5 - type_3)
	      (pred_2 ?v7 - type_1 ?v6 - type_2)
	      (pred_4 ?v7 - type_1 ?v2 - object ?v6 - type_2))

   (:action op_1
       :parameters  (?v7 - type_1 ?v4 ?v8 - type_3)
       :precondition (and  (pred_3 ?v7 ?v4))
       :effect (and  (pred_3 ?v7 ?v8)
		     (not (pred_3 ?v7 ?v4))))

   (:action op_3
       :parameters (?v7 - type_1 ?v1 - object ?v3 - type_3 ?v6 - type_2)
       :precondition  (and  (pred_1 ?v1 ?v3) (pred_3 ?v7 ?v3) (pred_2 ?v7 ?v6))
       :effect (and (pred_4 ?v7 ?v1 ?v6)
		    (not (pred_1 ?v1 ?v3)) 
		    (not (pred_2 ?v7 ?v6))))

   (:action op_2
       :parameters (?v7 - type_1 ?v1 - object ?v3 - type_3 ?v6 - type_2)
       :precondition  (and  (pred_4 ?v7 ?v1 ?v6) (pred_3 ?v7 ?v3))
       :effect (and (pred_1 ?v1 ?v3)
		    (pred_2 ?v7 ?v6)
		    (not (pred_4 ?v7 ?v1 ?v6)))))

; problem
(define (problem gripper-1-4-3)
(:domain gripper-strips)
(:objects obj_08 - type_1
obj_09 obj_06 - type_2
obj_05 obj_10 obj_01 obj_03 - type_3
obj_04 obj_02 obj_07 - object)
(:init
(pred_3 obj_08 obj_03)
(pred_2 obj_08 obj_09)
(pred_2 obj_08 obj_06)
(pred_1 obj_04 obj_10)
(pred_1 obj_02 obj_01)
(pred_1 obj_07 obj_03)
)
(:goal
(and
(pred_1 obj_04 obj_01)
(pred_1 obj_02 obj_05)
(pred_1 obj_07 obj_03)
)
)

(:constraints
  (always (forall (?b - object)
           (not (pred_4 obj_08 ?b obj_09))))
)
)

; plan
1. (op_1 obj_08 obj_03 obj_01)
   deleted: (pred_3 obj_08 obj_03)
   added: (pred_3 obj_08 obj_01)
   goals met: 1 of 3
2. (op_3 obj_08 obj_02 obj_01 obj_06)
   deleted: (pred_1 obj_02 obj_01) (pred_2 obj_08 obj_06)
   added: (pred_4 obj_08 obj_02 obj_06)
   goals met: 1 of 3
3. (op_1 obj_08 obj_01 obj_05)
   deleted: (pred_3 obj_08 obj_01)
   added: (pred_3 obj_08 obj_05)
   goals met: 1 of 3
4. (op_2 obj_08 obj_02 obj_05 obj_06)
   deleted: (pred_4 obj_08 obj_02 obj_06)
   added: (pred_1 obj_02 obj_05) (pred_2 obj_08 obj_06)
   goals met: 2 of 3
5. (op_1 obj_08 obj_05 obj_01)
   deleted: (pred_3 obj_08 obj_05)
   added: (pred_3 obj_08 obj_01)
   goals met: 2 of 3
6. (op_1 obj_08 obj_01 obj_10)
   deleted: (pred_3 obj_08 obj_01)
   added: (pred_3 obj_08 obj_10)
   goals met: 2 of 3
7. (op_3 obj_08 obj_04 obj_10 obj_06)
   deleted: (pred_1 obj_04 obj_10) (pred_2 obj_08 obj_06)
   added: (pred_4 obj_08 obj_04 obj_06)
   goals met: 2 of 3
8. (op_1 obj_08 obj_10 obj_01)
   deleted: (pred_3 obj_08 obj_10)
   added: (pred_3 obj_08 obj_01)
   goals met: 2 of 3
9. (op_2 obj_08 obj_04 obj_01 obj_06)
   deleted: (pred_4 obj_08 obj_04 obj_06)
   added: (pred_1 obj_04 obj_01) (pred_2 obj_08 obj_06)
   goals met: 3 of 3
